capita-API_tests/target/test-classes/data/TryGetByCorrespondenceId.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:doc="https://www.capita.co.uk/TfL/docstore">
   <soapenv:Header/>
   <soapenv:Body>
      <doc:TryGetByCorrespondenceId>
         <!--Optional:-->
         <doc:sourceSystem>#(sourcesystem)</doc:sourceSystem>
         <!--Optional:-->
         <doc:correspondenceId>#(corrid)</doc:correspondenceId>
      </doc:TryGetByCorrespondenceId>
   </soapenv:Body>
</soapenv:Envelope>